#### BuiltInFailures.GenericFailures Members

---

|  |
| --- |
| BuiltInFailures GenericFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures GenericFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | ElementsInInvalidContext | There are elements in the document that exist in a context they should not. These elements must be deleted to continue using this project or family. |

# See Also

BuiltInFailures GenericFailures Class

Autodesk.Revit.DB Namespace